In [30]:
import pandas
import pandas as pd
import numpy as np
import sklearn
from sklearn.metrics import log_loss, roc_auc_score
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from tensorflow.python.keras.preprocessing.sequence import pad_sequences
import tensorflow as tf
from tqdm import tqdm

In [32]:
data_path = '/data/linghui/black-friday/'
train_file = data_path + 'train.csv'

row_data = pd.read_csv(train_file, sep=',')
row_data = row_data.fillna(0)
row_data.columns = ['user_id','product_id','gender','age','occupation','city','stay_years','martial_status','cate_1','cate_2','cate_3','price']
lbe_feats = ['user_id','product_id','gender','age','occupation','city','stay_years','martial_status','cate_1','cate_2','cate_3']
for feat in lbe_feats:
    lbe = LabelEncoder()
    row_data[feat] = lbe.fit_transform(row_data[feat])
row_data

,user_id,product_id,gender,age,occupation,city,stay_years,martial_status,cate_1,cate_2,cate_3,price
0,0,672,0,0,10,0,2,0,2,0,0,8370
1,0,2376,0,0,10,0,2,0,0,5,11,15200
2,0,852,0,0,10,0,2,0,11,0,0,1422
3,0,828,0,0,10,0,2,0,11,13,0,1057
4,1,2734,1,6,16,2,4,0,7,0,0,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,5883,3567,1,5,13,1,1,1,19,0,0,368
550064,5885,3568,0,2,1,2,3,0,19,0,0,371
550065,5886,3568,0,2,15,1,4,1,19,0,0,137
550066,5888,3568,0,6,1,2,2,0,19,0,0,365
550067,5889,3566,0,4,0,1,4,1,19,0,0,490

In [97]:
col_null = row_data.isnull().sum(axis=0)
col_null

user_id           0
product_id        0
gender            0
age               0
occupation        0
city              0
stay_years        0
martial_status    0
cate_1            0
cate_2            0
cate_3            0
price             0
dtype: int64

In [33]:
def create_black_friday_data(data):
    data = data.sort_values(['user_id'])
    num = len(data.user_id.value_counts())
    test_pd = pd.DataFrame(columns=data.columns)
    for i in range(num):
        user_select_group = data.loc[data['user_id'] == i]
        user_pd = user_select_group.iloc[-1]
        test_pd = test_pd.append(user_pd)
    drop_index = test_pd.index.to_list()
    train_pd = data[~data.index.isin(drop_index)]
    return train_pd,test_pd

train_data , test_data = create_black_friday_data(row_data)

In [35]:
train_data.user_id.value_counts()
# test_data.user_id.value_counts()

1634    1025
4166     978
1885     897
1142     861
863      822
        ...
2052       6
5253       6
2615       6
5467       6
686        5
Name: user_id, Length: 5891, dtype: int64

In [34]:
test_data

,user_id,product_id,gender,age,occupation,city,stay_years,martial_status,cate_1,cate_2,cate_3,price
1,0,2376,0,0,10,0,2,0,0,5,11,15200
116853,1,1972,1,6,16,2,4,0,5,7,0,20434
467670,2,1079,1,2,15,0,3,0,0,1,3,3938
8,3,3604,1,4,7,1,2,1,0,15,0,15686
78152,4,286,1,2,20,0,1,1,7,0,0,5894
...,...,...,...,...,...,...,...,...,...,...,...,...
233683,5886,1793,0,2,15,1,4,1,1,3,0,10117
78118,5887,3101,0,4,1,2,4,0,7,0,0,7924
506583,5888,1862,0,6,1,2,2,0,7,13,0,7815
78130,5889,1032,0,4,0,1,4,1,12,15,0,946
428891,5890,1067,1,2,6,1,2,0,15,0,0,16144

In [40]:
user_data = row_data.loc[:,['user_id','gender','age','occupation','city','stay_years','martial_status']]
user_data = user_data.drop_duplicates()
user_data = user_data.reset_index(drop=True)
user_data

      user_id  gender  age  occupation  city  stay_years  martial_status
0           0       0    0          10     0           2               0
1           1       1    6          16     2           4               0
2           2       1    2          15     0           3               0
3           3       1    4           7     1           2               1
4           4       1    2          20     0           1               1
...       ...     ...  ...         ...   ...         ...             ...
5886     4474       0    2           4     2           0               0
5887     4749       1    1          12     2           2               0
5888     4008       1    3          17     2           3               0
5889     5253       1    2           7     0           0               0
5890     1484       1    1           4     2           4               1

[5891 rows x 7 columns]

In [41]:
item_data = row_data.loc[:,['product_id','cate_1','cate_2','cate_3','price']]
item_data = item_data.drop_duplicates()
item_data = item_data.reset_index(drop=True)
item_data

        product_id  cate_1  cate_2  cate_3  price
0              672       2       0       0   8370
1             2376       0       5      11  15200
2              852      11       0       0   1422
3              828      11      13       0   1057
4             2734       7       0       0   7969
...            ...     ...     ...     ...    ...
473628        3567      19       0       0    123
473629        3566      19       0       0    591
473630        3568      19       0       0    125
473631        3567      19       0       0    374
473632        3568      19       0       0    486

[473633 rows x 5 columns]

In [53]:
item_num = item_data['product_id'].nunique()
item_price_dict = {}
for i in range(item_num):
    item_temp = item_data.loc[item_data['product_id'] == i]
    item_price = item_temp['price'].unique()
    item_price_dict[i] = item_price

In [63]:
price_list = item_price_dict[0]
a = np.random.choice(price_list, size=1, replace=True)
a[0]

10947

In [108]:
def neg_sample(u_data, item_ids,neg_rate_train=1,neg_rate_test = 49):
    print('start neg sample')
    neg_data_train = []
    neg_data_test = []
    for user_id, hist in tqdm(u_data.groupby('user_id')):
        purchased_item_list = hist['product_id'].tolist()
        candidate_set = list(set(item_ids) - set(purchased_item_list))
        neg_list_train = np.random.choice(candidate_set, size=(len(purchased_item_list)-1) * neg_rate_train, replace=True)
        neg_list_test = np.random.choice(candidate_set, size=neg_rate_test, replace=True)
        for id in neg_list_train:
            list_train = create_neg_data(user_id,id,item_price_dict)
            neg_data_train.append(list_train)
        for id in neg_list_test:
            list_test = create_neg_data(user_id,id,item_price_dict)
            neg_data_test.append(list_test)
    u_data_neg_train = pd.DataFrame(neg_data_train)
    u_data_neg_test = pd.DataFrame(neg_data_test)
    print(u_data_neg_train)
    print(u_data_neg_test)
    u_data_neg_train.columns = ['user_id', 'product_id', 'price']
    u_data_neg_test.columns = ['user_id', 'product_id', 'price']
    return u_data_neg_train,u_data_neg_test

def create_neg_data(user_id,item_id,item_price_dict):
    price_list = item_price_dict[item_id]
    price = np.random.choice(price_list, size=1, replace=True)
    price = price[0]
    result = [user_id,item_id,price]
    return result

In [109]:
item_ids = item_data['product_id'].unique()
neg_train , neg_test = neg_sample(row_data,item_ids , 1, 49)
neg_train = pd.merge(neg_train, user_data , on=['user_id'],how = 'left')
neg_train = pd.merge(neg_train, item_data,  on=['product_id','price'],how = 'left')

neg_test = pd.merge(neg_test, user_data , on=['user_id'],how = 'left')
neg_test = pd.merge(neg_test, item_data,  on=['product_id','price'],how = 'left')

start neg sample

100%|â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆ| 5891/5891 [00:28<00:00, 209.47it/s]

           0     1      2
0          0   409   7792
1          0  2340   7418
2          0   957   5824
3          0  2242   5973
4          0  3583  13309
...      ...   ...    ...
544172  5890  1121  12799
544173  5890  2285   7108
544174  5890  2500  16740
544175  5890  3519   4696
544176  5890  3096   8652

[544177 rows x 3 columns]
           0     1      2
0          0  1430  12153
1          0  2212   1662
2          0  1115   1982
3          0  1341   4241
4          0  2890   4294
...      ...   ...    ...
288654  5890  3419  11584
288655  5890  2566   3454
288656  5890  2412   7785
288657  5890  1865   5296
288658  5890  1846  16553

[288659 rows x 3 columns]

In [110]:
neg_train

,user_id,product_id,price,gender,age,occupation,city,stay_years,martial_status,cate_1,cate_2,cate_3
0,0,409,7792,0,0,10,0,2,0,7,0,0
1,0,2340,7418,0,0,10,0,2,0,10,0,0
2,0,957,5824,0,0,10,0,2,0,7,0,0
3,0,2242,5973,0,0,10,0,2,0,7,0,0
4,0,3583,13309,0,0,10,0,2,0,1,3,0
...,...,...,...,...,...,...,...,...,...,...,...,...
544172,5890,1121,12799,1,2,6,1,2,0,1,0,0
544173,5890,2285,7108,1,2,6,1,2,0,4,7,0
544174,5890,2500,16740,1,2,6,1,2,0,15,0,0
544175,5890,3519,4696,1,2,6,1,2,0,10,0,0
544176,5890,3096,8652,1,2,6,1,2,0,14,15,0

In [107]:
train_data

,user_id,product_id,gender,age,occupation,city,stay_years,martial_status,cate_1,cate_2,cate_3,price
0,0,672,0,0,10,0,2,0,2,0,0,8370
467664,0,2098,0,0,10,0,2,0,7,0,0,7953
467663,0,570,0,0,10,0,2,0,2,3,9,11051
428894,0,722,0,0,10,0,2,0,2,3,9,10572
428893,0,249,0,0,10,0,2,0,0,1,6,15416
...,...,...,...,...,...,...,...,...,...,...,...,...
194557,5890,2844,1,2,6,1,2,0,6,0,0,21005
506600,5890,3290,1,2,6,1,2,0,4,17,0,6915
506599,5890,867,1,2,6,1,2,0,7,0,0,9868
506598,5890,3321,1,2,6,1,2,0,0,14,0,15358
506596,5890,3353,1,2,6,1,2,0,5,7,0,16389

In [111]:
train_data_final = pd.concat([train_data,neg_train])

In [112]:
train_data_final

,user_id,product_id,gender,age,occupation,city,stay_years,martial_status,cate_1,cate_2,cate_3,price
0,0,672,0,0,10,0,2,0,2,0,0,8370
467664,0,2098,0,0,10,0,2,0,7,0,0,7953
467663,0,570,0,0,10,0,2,0,2,3,9,11051
428894,0,722,0,0,10,0,2,0,2,3,9,10572
428893,0,249,0,0,10,0,2,0,0,1,6,15416
...,...,...,...,...,...,...,...,...,...,...,...,...
544172,5890,1121,1,2,6,1,2,0,1,0,0,12799
544173,5890,2285,1,2,6,1,2,0,4,7,0,7108
544174,5890,2500,1,2,6,1,2,0,15,0,0,16740
544175,5890,3519,1,2,6,1,2,0,10,0,0,4696
544176,5890,3096,1,2,6,1,2,0,14,15,0,8652